// ru
window.ruTranslations = window.ruTranslations || {};
window.ruTranslations.characters = {
    "Reimu": {
        "name": "Хакурэй Рейму",
        "title": "Райская жрица",
        "description": "Медленный, но сбалансированный персонаж с более слабой наводящейся атакой и спеллкартой",
    },
    "Marisa": {
        "name": "Мариса Кирисамэ",
        "title": "Обыкновенная волшебница",
        "description": "Персонаж, компенсирующий свою малую дальность высокой скоростью и сильной атакой",
    },
    "Murasa": {
        "name": "Минамицу Мураса",
        "title": "Призрак, оставленный после кораблекрушения ",
        "description": "Средний персонаж, имеющий сбалансированные параметры",
    },
    "Nue": {
        "name": "Нуэ Ходзю",
        "title": "Неопознанный фантастический летающий инопланетянин",
        "description": "Персонаж, который силен в ближнем бою, если вы конечно смеете подобраться близко. Компенсируется своей скоростью",
    }
};