{
    "01": {
        "name": "Легенда о Хорае",
        "title": "Тема главного меню",
        "comment": "Говорят, что Эликсир Бессмертия не смогли отыскать даже<br>слуги императора Цинь Шихуан-ди... О чём же тогда думает Кагуя?<br>Поиск жемчужной ветви Хорай – чистой воды безрассудство"
    },
    "02": {
        "name": "Любовная насыпь цветков сакуры",
        "title": "Тема первого уровня",
        "comment": "Лежит ли ### под той сакурой до сих пор? Лепестки, в былом столь алые,<br>с годами становятся всё бледнее и бледнее.<br>Вероятно, в земле уже давно ничего не осталось."
    },
    "03": {
        "name": "Невероятная восточная беседа",
        "title": "Тема ###",
        "comment": "Ёкаи? Как нелепо, для нашего времени. Но я знаю. Знаю,<br>что если ёкаи заставят людей так думать, то смогут жить спокойно.<br>Ёкаи — куда более мирные и прагматичные существа, нежели люди."
    },
    "04": {
        "name": "Цирковые мечтания",
        "title": "Тема второго уровня",
        "comment": "Итак, следующим на сцене будет выступление человека-птицы. Этот отрок был рождён от союза человека и чрезвычайно редкой райской птицы, живущей на далёких южных островах. Его родители давно умерли, поэтому мы сжалились над бедным сиротой и приняли его к себе в труппу. Мы поступили хорошо, не так ли?"
    },
    "05": {
        "name": "Алиса из Шанхая в семнадцатый год Мэйдзи",
        "title": "Тема ####",
        "comment": "Опиумный дым, собираясь в пелену облаков, просачивается в каждый уголок улицы. Я нахожусь в иноземном квартале. Люди, ряженые в одежды богатейшего окраса, танцуют вальс. Здесь это волшебство меня не достанет."
    },
    "06": {
        "name": "Ведьма любовного зелья",
        "title": "Тема третьего уровня",
        "comment": "Ни в коем случае. Я же не дурак, в конце концов. Если бы я рассказал об этом друзьям, они бы только подняли меня на смех. Они ни за что не поверят, что в том магазине продаётся любовное зелье. Поэтому я, никому об этом не сказав, разбил свою свинью-копилку."
    },
    "07": {
        "name": "А. Н. Оним был девушкой?",
        "title": "Тема Фландре",
        "comment": "Из-за отсутствия воображения расправиться с вами проще простого. Преступник с воображением А. Н. Онима в два счета обведет вас вокруг пальца"
    },
    "08": {
        "name": "Кукольный лес",
        "title": "Тема четвертого уровня",
        "comment": "Дождь не прекращается. С тех пор, как я забрела в этот дом, я ни разу не видела солнца. Прошло уже несколько дней.Кукла постоянно со мной разговаривает. Я отрезал голову куклы. Похоже, дождь прекратился"
    },
    "09": {
        "name": "Энигматичная кукла",
        "title": "Тема куклы",
        "comment": "Эх, как же я хочу поскорее избавиться от этой куклы. Эти синие глаза… Порой прилетает чёрный ворон и выедает их. А это настоящие глаза. Потому что я всегда вставляю новые"
    },
    "10": {
        "name": "Реинкарнация",
        "title": "Тема пятого уровня",
        "comment": "Как ни глянь, то, что посреди бездорожного леса стоял особняк в западном стиле – уже странно. Девушка, жившая там, очень редко выходила в город. Но недавно я видел юную особу, похожую на её дочь. С чего я решил, что это её дочь? Просто она выглядит точь-в-точь так, как та девушка в юности"
    },
    "11": {
        "name": "Двухцветная бабочка лотоса ~ Red and White",
        "title": "Тема безымянных",
        "comment": "Опять какая-то чудачка затерялась в округе. Надо что-то с ней сделать, пока она не добралась до храма... О, да она же... Она не похожа ни на человека, ни на ёкая"
    },
    "12": {
        "name": "Вечная жрица",
        "title": "Тема плохой концовки",
        "comment": "Вот и снова за целый день ничего не произошло. И мне пообещали, что завтра тоже ничего не произойдёт.Сюда никто никогда не приходит. Ни люди, ни боги.Ёкаи? А, да, они здесь каждый день бывают."
    },
    "13": {
        "name": "Удивительные дни летящей по небу жрицы",
        "title": "Тема хорошей концовки",
        "comment": "В последнее время люди всё чаще говорят всякую устаревшую чушь, вроде «это магия», или «это ёкай». Как прискорбно."
    }
}