{
    "01": {
        "name": "Legenden om Hourai",
        "title": "Titteltemaet",
        "comment": "Det sies at til og med tjenerne til keiser Qin Shi Huangdi<br>ikke kunne finne eliksiren til udødelighet, alikevel...<br>Hva er det prinsesse Kaguya tenkte?<br>... Tror hun virkelig at vi kunne finne ting som den juvelfylte Gren av Hourai?"
    },
    "02": {
        "name": "Nydelig Haug med Kirsebærblomster",
        "title": "Etappe 1 tema",
        "comment": "Jeg lurer på om ### fremdeles sover under kirsebærtreet.<br>Blomsterbladene var en gang karmosinrød farget, men de blir blekere år for år.<br>Det er muligens ingenting igjen under jorden."
    },
    "03": {
        "name": "Merkelig Østerlandsk Drøftelse",
        "title": "###s tema",
        "comment": "Vesen? I disse tider er det ganske ufornuftig.<br>men, Jeg vet. At vesen-ene vil leve i fred hvis menneskene hadde troen om det.<br>Vesen er mer fredfulle og pragmatiske enn mennesker."
    },
    "04": {
        "name": "Sirkusdrømmeri",
        "title": "Etappe 2 tema",
        "comment": "Greit, nestemann på scenen er en fugleperson.<br> Denne fuglepersonen var på en eller annen måte født fra<br>foreningen mellom et menneske og en sjelden fugl<br>av paradis som bare lever i et land langt sør.<br>Dens foreldre døde for lenge siden. Vi syntes synd på det stakkars barnet,<br>så vi tok dem in i vår tropp. Er ikke det snilt av oss?"
    },
    "05": {
        "name": "Shanghai Alice av Meiji 17",
        "title": "####s tema",
        "comment": "Opiumsrøyk henger igjen i en sky over Byen, som fyller opp hver krik og krok.<br>Jeg er inn i bosetningen. Folket danser en vals i klær av de mest strålende farger.<br>Magien når meg ikke her."
    },
    "06": {
        "name": "Kjærlighetsdrikkens Heks",
        "title": "Etappe 3 tema",
        "comment": "Ikke tale om. Du vet Jeg ikke er dum.<br>Vennene mine ville led av meg hvis jeg fortalte dem.<br>De ville ikke trodd meg hvis jeg sa jeg solgte kjærlighetsdrikker i den butikken.<br>Jeg brøt opp sparegrisen min uten å si til noen."
    },
    "07": {
        "name": "U.N Owen var henne?",
        "title": "Flandre's tema",
        "comment": "Du har ingen fantasi. Du hadde falt for fellen Deres uten tvil.<br>En kriminel med så mye fantasi som U.N. Owen<br>kunne ha bundet et tau rundt halsen din før hanen galer."
    },
    "08": {
        "name": "Dukkeskogen",
        "title": "Etappe 4 tema",
        "comment": "Regnet tar aldri slutt.<br>Jeg har ikke sett sollys helt siden Jeg snublet Meg inn i dette huset.<br>Jeg lurer på manga dager det har gått.<br>Dukken Snakker til Meg som en foss.<br>Jeg kappet hodet av den. Ser ut som at regnet sluttet."
    },
    "09": {
        "name": "Gåtefull Dukke",
        "title": "Dukkens tema",
        "comment": "Jeg ønsket å bekvitt denne dukken så fort så mulig også.<br>Men, dette er blå øyne. Av og til så frakter en svart kråke dem bort.<br>De er ekte, fordi Jeg setter alltid inn nye øyne."
    },
    "10": {
        "name": "Reinkarnasjon",
        "title": "Etappe 5 tema",
        "comment": "Rart å se et vestligvent hus i midten av en veiløs skog til å begynne med.<br>Jenta som bodde der kom sjeldent til byen.<br>I senere tid har Jeg sett en pike som ser ut som datteren hennes.<br>Hvordan viste Jeg hun hadde en datter?<br>Vel, piken ser ut som henne da hun var yngre..."
    },
    "11": {
        "name": "Tofarget Lotus Sommerfugl ~ Rødt og hvitt",
        "title": "Den navnløses tema",
        "comment": "Ser ut som en merkelig person har sneket seg inn igjen.<br>Jeg burde kanskje gjøre noe før hun når alteret...<br>vent lit, den jenta der... Ser verken ut som et menneske eller en vesen."
    },
    "12": {
        "name": "Evigvarende Alterpike",
        "title": "Dårlig Slutt tema",
        "comment": "Ingenting skjedde i hele dag.<br>Jeg ble lovet Ingenting imorgen også.<br>Ingen kommer hit. Ikke mennesker, ikke guder.<br>Vesen? Nei de kommer hver dag."
    },
    "13": {
        "name": "Den Merkelige Hverdagen til den Flygende Alterpiken",
        "title": "God slutt tema",
        "comment": "I senere tid har flere folk begynt si ting som \"Det er magi\" eller<br>\"Det er vesen\" som noen idioter.<br>Trist at det må være slik."
    }
}